# Data Manuplation

In [1]:
import pandas as pd

Note: When ever you read data in pandas it will try to give a Dataframe, Dataframe is nothing but a tablure kind of a structure

In [2]:
titanic_train=pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv"
                ,sep='\t')
#titanic_train
# it is going to undersand first row as column values

In [3]:
type(titanic_train)

pandas.core.frame.DataFrame

In [4]:
titanic_train.head()#head always try to show first 5 rows in the data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
titanic_train.tail()# if i i wanted fetch data from last rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [6]:
#suppose if i wanted to select the some of the columns
titanic_train[['PassengerId','Pclass','Name']].head() #i.e multiple columns
#if u fetch a multiple columns or mutiple rows then it is a Dataframe
#when ever you are trying to load a mutiple columns we have to write columns in the form of a list

   PassengerId  Pclass                                               Name
0            1       3                            Braund, Mr. Owen Harris
1            2       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2            3       3                             Heikkinen, Miss. Laina
3            4       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4            5       3                           Allen, Mr. William Henry

In [7]:
titanic_train['PassengerId']#ifwant to get data from single column
#if you fetch a single then it becomes series

0        1
1        2
2        3
3        4
4        5
      ...
151    152
152    153
153    154
154    155
155    156
Name: PassengerId, Length: 156, dtype: int64

In [8]:
titanic_train[['PassengerId']].head()

   PassengerId
0            1
1            2
2            3
3            4
4            5

In [9]:
type(titanic_train['Name'])#Note: A series behave like a list but its not a list

pandas.core.series.Series

In [10]:
type(titanic_train[['Name']])

pandas.core.frame.DataFrame

In [11]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [12]:
titanic_train.dtypes==object

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [13]:
titanic_train.dtypes[titanic_train.dtypes==object]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [14]:
titanic_train.dtypes[titanic_train.dtypes==object].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [15]:
#if i wanted to filter out those columns which is having the object type for that you need to store in to the variable
a=titanic_train.dtypes[titanic_train.dtypes==object].index
a
titanic_train[a]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
151,"Pears, Mrs. Thomas (Edith Wearne)",female,113776,C2,S
152,"Meo, Mr. Alfonzo",male,A.5. 11206,NaN,S
153,"van Billiard, Mr. Austin Blyler",male,A/5. 851,NaN,S
154,"Olsen, Mr. Ole Martin",male,Fa 265302,NaN,S
155,"Williams, Mr. Charles Duane",male,PC 17597,NaN,C

In [16]:
#describe always give you discription of the data
titanic_train[a].describe()
#top always give you the first data set
#freq means nothing frequency which is nothing but number of occerances
#note: we will be able to get describtion only for categorical data set not a numerical data set at any point

,Name,Sex,Ticket,Cabin,Embarked
count,156,156,156,31,155
unique,156,2,145,28,3
top,"Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...",male,CA 2144,C23 C25 C27,S
freq,1,100,2,2,110

In [17]:
#here iam going to dicrdtion to entire dataframe
titanic_train.describe()
#if you  fire  describe command to entire data frame by default it is going to get those values which is going to have numerical columns or numriacal data set whether it is integer are float
#std: How your data is fluctuating from the mean
#min : what is the minimum value of the data in this perticular column so if i talk about fare in the titanic data set min fare was 6.75

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [18]:
sorted(titanic_train['Name'])

['Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',
 'Allen, Mr. William Henry',
 'Andersson, Miss. Ellis Anna Maria',
 'Andersson, Miss. Erna Alexandra',
 'Andersson, Mr. Anders Johan',
 'Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andreasson, Mr. Paul Edvin',
 'Andrew, Mr. Edgardo Samuel',
 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)',
 'Attalah, Miss. Malake',
 'Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)',
 'Barton, Mr. David John',
 'Bateman, Rev. Robert James',
 'Baxter, Mr. Quigg Edmond',
 'Beesley, Mr. Lawrence',
 'Bing, Mr. Lee',
 'Bonnell, Miss. Elizabeth',
 'Boulos, Mrs. Joseph (Sultana)',
 'Braund, Mr. Owen Harris',
 'Burke, Mr. Jeremiah',
 'Byles, Rev. Thomas Roussel Davids',
 'Caldwell, Master. Alden Gates',
 'Cann, Mr. Ernest Charles',
 'Carrau, Mr. Francisco M',
 'Celotti, Mr. Francesco',
 'Chaffee, Mr. Herbert Fuller',
 'Christmann, Mr. Emil',
 'Chronopoulos, Mr. Apostolos',
 'Coelho, Mr. Domingos Fernandeo',
 'Connors, Mr. Patrick',
 'Coxon, Mr. Daniel',
 'Crease, Mr. Ernest James',
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
 'Dean, Mr. Bertram Frank',
 'Devaney, Miss. Margaret Delia',
 'Doling, Mrs. John T (Ada Julia Bone)',
 'Dowdell, Miss. Elizabeth',
 'Drazenoic, Mr. Jozef',
 'Ekstrom, Mr. Johan',
 'Emir, Mr. Farred Chehab',
 'Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkinson)',
 'Ford, Miss. Robina Maggie "Ruby"',
 'Ford, Mr. William Neal',
 'Fortune, Miss. Mabel Helen',
 'Fortune, Mr. Charles Alexander',
 'Futrelle, Mr. Jacques Heath',
 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
 'Fynney, Mr. Joseph J',
 'Giglio, Mr. Victor',
 'Glynn, Miss. Mary Agatha',
 'Goldschmidt, Mr. George B',
 'Goodwin, Master. William Frederick',
 'Goodwin, Miss. Lillian Amy',
 'Greenfield, Mr. William Bertram',
 'Gustafsson, Mr. Anders Vilhelm',
 'Hakkarainen, Mrs. Pekka Pietari (Elin Matilda Dolck)',
 'Harper, Mrs. Henry Sleeper (Myna Haxtun)',
 'Harris, Mr. Henry Birkhardt',
 'Heikkinen, Miss. Laina',
 'Hewlett, Mrs. (Mary D Kingcome) ',
 'Hickman, Mr. Stanley George',
 'Holverson, Mr. Alexander Oskar',
 'Hood, Mr. Ambrose Jr',
 'Icard, Miss. Amelie',
 'Ilett, Miss. Bertha',
 'Jenkin, Mr. Stephen Curnow',
 'Johansson, Mr. Gustaf Joel',
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
 'Jussila, Miss. Katriina',
 'Kantor, Mr. Sinai',
 'Kink, Mr. Vincenz',
 'Kraeff, Mr. Theodor',
 'Laroche, Miss. Simonne Marie Anne Andree',
 'Lennon, Mr. Denis',
 'Madsen, Mr. Fridtjof Arne',
 'Mamee, Mr. Hanna',
 'Masselmani, Mrs. Fatima',
 'McCarthy, Mr. Timothy J',
 'McDermott, Miss. Brigdet Delia',
 'McGowan, Miss. Anna "Annie"',
 'McMahon, Mr. Martin',
 'Meo, Mr. Alfonzo',
 'Meyer, Mr. Edgar Joseph',
 'Mionoff, Mr. Stoytcho',
 'Moen, Mr. Sigurd Hansen',
 'Moore, Mr. Leonard Charles',
 'Moran, Miss. Bertha',
 'Moran, Mr. James',
 'Moss, Mr. Albert Johan',
 'Moubarek, Master. Gerios',
 'Moutal, Mr. Rahamin Haim',
 'Nasser, Mr. Nicholas',
 'Nasser, Mrs. Nicholas (Adele Achem)',
 'Navratil, Mr. Michel ("Louis M Hoffman")',
 'Newsom, Miss. Helen Monypeny',
 'Nicholls, Mr. Joseph Charles',
 'Nicola-Yarred, Master. Elias',
 'Nicola-Yarred, Miss. Jamila',
 'Nosworthy, Mr. Richard Cater',
 'Novel, Mr. Mansouer',
 'Nye, Mrs. (Elizabeth Ramell)',
 'Nysten, Miss. Anna Sofia',
 "O'Driscoll, Miss. Bridget",
 'O\'Dwyer, Miss. Ellen "Nellie"',
 'Olsen, Mr. Ole Martin',
 'Osen, Mr. Olaf Elon',
 'Ostby, Mr. Engelhart Cornelius',
 'Palsson, Master. Gosta Leonard',
 'Palsson, Miss. Torborg Danira',
 'Panula, Master. Juha Niilo',
 'Pears, Mrs. Thomas (Edith Wearne)',
 'Pekoniemi, Mr. Edvard',
 'Peter, Miss. Anna',
 'Petranec, Miss. Matilda',
 'Petroff, Mr. Pastcho ("Pentcho")',
 'Porter, Mr. Walter Chamberlain',
 'Rekic, Mr. Tido',
 'Rice, Master. Eugene',
 'Richard, Mr. Emile',
 'Robins, Mrs. Alexander A (Grace Charity Laury)',
 'Rogers, Mr. William John',
 'Rugg, Miss. Emily',
 'Salkjelsvik, Miss. Anna Kristine',
 'Samaan, Mr. Youssef',
 'Sandstrom, Miss. Marguerite Rut',
 'Saundercock, Mr. William Henry',
 'Sheerlinck, Mr. Jan Baptist',
 'Shorney, Mr. Charles Joseph',
 'Sirayanian, Mr. Orsen',
 'Skoog, Master. Harald',
 'Slocovski, Mr. Selman Francis',
 'Sloper, Mr. William Thompson',
 'Sobey, Mr. Samuel James Hayden',
 'Spencer, Mrs. William Augustus (Marie Eugenie)',
 'Staneff, Mr. Ivan',
 'Stewart, Mr. Albert A',
 'Todoroff, Mr. Lalio',
 'Turpin, Mr. William John Robert',
 'Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)',
 'Uruchurtu, Don. Manuel E',
 'Vander Planke, Miss. Augusta Maria',
 'Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)',
 'Vestrom, Miss. Hulda Amanda Adolfina',
 'Waelens, Mr. Achille',
 'Webber, Miss. Susan',
 'Weisz, Mrs. Leopold (Mathilde Francoise Pede)',
 'West, Miss. Constance Mirium',
 'Wheadon, Mr. Edward H',
 'White, Mr. Percival Wayland',
 'White, Mr. Richard Frasar',
 'Williams, Mr. Charles Duane',
 'Williams, Mr. Charles Eugene',
 'Woolner, Mr. Hugh',
 'Zabour, Miss. Hileni',
 'van Billiard, Mr. Austin Blyler']

In [19]:
#Here iam selecting data form 5th index till 10th index and making a jump of 2
sorted(titanic_train['Name'])[5:10:2]

['Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andrew, Mr. Edgardo Samuel',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)']

In [20]:
#Here iam doing discribtion of name column
titanic_train['Name'].describe()

count                                                   156
unique                                                  156
top       Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...
freq                                                      1
Name: Name, dtype: object

In [21]:
#Here iam doing slicling operation
titanic_train['Ticket'][4:9]

4    373450
5    330877
6     17463
7    349909
8    347742
Name: Ticket, dtype: object

In [22]:
#if want to get in data frame format
titanic_train[['Ticket']][4:9]

   Ticket
4  373450
5  330877
6   17463
7  349909
8  347742

In [23]:
titanic_train[['Ticket']].describe()

         Ticket
count       156
unique      145
top     CA 2144
freq          2

In [24]:
titanic_train['Ticket'].describe()

count         156
unique        145
top       CA 2144
freq            2
Name: Ticket, dtype: object

In [25]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [26]:
#Here iam calling dataframe and i am trying to give column name as test Here test is not a part of the dataframe
#if this column is avalible it try to override
#if it is not available it try to create new column operation
#here iam creating a test column and assign values 0 to the column
titanic_train['test']=0
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [27]:
titanic_train['pradeep']="223"
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,pradeep
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,223
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,223
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,223
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,223
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,223

In [28]:
titanic_train['Cabin'][0:15]

0      NaN
1      C85
2      NaN
3     C123
4      NaN
5      NaN
6      E46
7      NaN
8      NaN
9      NaN
10      G6
11    C103
12     NaN
13     NaN
14     NaN
Name: Cabin, dtype: object

In [29]:
titanic_train['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
151    1
152    0
153    0
154    0
155    0
Name: Survived, Length: 156, dtype: int64

In [30]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'test', 'pradeep'],
      dtype='object')

# Categorical

In [31]:
#pd.categorical:List down all the data and it trying to tell you that how many distinct categoried inside this column

In [32]:
new_pclass=pd.Categorical(titanic_train['Pclass'])
new_pclass# Here we have 3 distinc categoried the 1,2,3

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [33]:
#Here my requirement is to convert 1 2 3 to some other varibles
new_pclass=new_pclass.rename_categories(['p1','p2','p3'])
new_pclass

[p3, p1, p3, p1, p3, ..., p1, p3, p3, p3, p1]
Length: 156
Categories (3, object): [p1, p2, p3]

In [34]:
titanic_train['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
151    1
152    3
153    3
154    3
155    1
Name: Pclass, Length: 156, dtype: int64

In [35]:
titanic_train['Pclass']=new_pclass
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,pradeep
0,1,0,p3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,223
1,2,1,p1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,223
2,3,1,p3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,223
3,4,1,p1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,223
4,5,0,p3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,223

In [36]:
titanic_train.dtypes['Cabin']

dtype('O')

In [37]:
import  numpy as np
            char_cabin=titanic_train['Cabin'].astype(str)#convering entir cabin column to string
char_cabin

IndentationError: unexpected indent (<ipython-input-37-aefba76969b5>, line 2)

In [38]:
#Here iam doing list comprehension operation and iam trying to extract first charactres of cabin column
new_cabin=[cabin[0] for cabin in char_cabin]
new_cabin

NameError: name 'char_cabin' is not defined

In [39]:
new_cabin=pd.Categorical(new_cabin)
new_cabin

NameError: name 'new_cabin' is not defined

In [40]:
#Here iam trying to create new column i.e Cabin1
titanic_train['Cabin1']=new_cabin
titanic_train.head()

NameError: name 'new_cabin' is not defined

In [41]:
#is null is give you to True or Flase like a boolean value
#when ever data is going to be null that point of a time it is going to give you true  , nullor nan = true i.e 0
#when ever data is not null it is going to give you false, not null means there is some value , not null = flase
titanic_train['Age'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [42]:
titanic_train['Age'].tail()

151    22.0
152    55.5
153    40.5
154     NaN
155    51.0
Name: Age, dtype: float64

In [43]:
import numpy as np

In [44]:
missing=np.where(titanic_train['Age'].isnull()==True)
missing
#where condition always do the filter condition i.e it will give you the index

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [45]:
np.where(titanic_train['Fare']==max(titanic_train['Fare']))
#At 27th and 28th index the fare is maximum
#here index means row

(array([27, 88], dtype=int64),)

In [46]:
#if you know the row index then you will able to fetch data by using function called iloc 
#iloc is nothing but integer location it will fetch the entire row
titanic_train.iloc[np.where(titanic_train['Fare']==max(titanic_train['Fare']))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,pradeep
27,28,0,p1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C23 C25 C27,S,0,223
88,89,1,p1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C23 C25 C27,S,0,223

In [47]:
len(missing[0])

30

In [48]:
#Here iam doing the concatination operation and  iam trying to create a new column called family
titanic_train['Family'] =titanic_train['SibSp']+titanic_train['Parch']
titanic_train[['Family']]
most_family=np.where(titanic_train['Family']==max(titanic_train['Family']))
most_family

(array([59, 71], dtype=int64),)

In [49]:
titanic_train.iloc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,pradeep,Family
59,60,0,p3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,NaN,S,0,223,7
71,72,0,p3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,NaN,S,0,223,7

# Series Operation

In [50]:
import numpy as np
import pandas as pd

In [51]:
lables=['a','b','c']# creating list of the character
my_data=[10,20,30]# creating a list of numeric values
arr=np.array(my_data)#here iam converting list to array
d={'a':10,'b':20,'c':30}

#Here i want convert entire thing in to pandas i.e here iam doing list to series converstion
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [52]:
pd.Series(my_data,index=lables)

a    10
b    20
c    30
dtype: int64

In [53]:
print("\n Holding numerical data\n","-"*25,sep='')
print(pd.Series(arr))

 Holding numerical data
-------------------------
0    10
1    20
2    30
dtype: int32

In [54]:
print("Holding text labels\n",'-'*20,sep='')
print(pd.Series(lables))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [55]:
print("Holding numerical data\n",'-'*20,sep='')
print(pd.Series(lables)[2])

Holding numerical data
--------------------
c

# Coverting Dictionaries in to the series

In [56]:
d={"Name":"pradeep","ID":223,"Height":5.8}
d.items

In [57]:
pd.DataFrame(d,index=['Name','ID','Height'])

           Name   ID  Height
Name    pradeep  223     5.8
ID      pradeep  223     5.8
Height  pradeep  223     5.8

In [58]:
print("Hoding objects from dictionary items\n",'-'*40,sep='')
print(pd.Series([type,d.items(),d.values()]))

Hoding objects from dictionary items
----------------------------------------
0                                 <class 'type'>
1    ((Name, pradeep), (ID, 223), (Height, 5.8))
2                            (pradeep, 223, 5.8)
dtype: object

In [59]:
pd.Series([type,sum,d.values()])

0             <class 'type'>
1    <built-in function sum>
2        (pradeep, 223, 5.8)
dtype: object

In [60]:
ser1=pd.Series([1,2,3,4],["CA","CB","OR","CO"])
ser1

CA    1
CB    2
OR    3
CO    4
dtype: int64

In [61]:
ser1['OR']

3

In [62]:
ser1['CA']

1

In [63]:
print("Slicing \n",ser1[0:3:2],sep='')

Slicing
CA    1
OR    3
dtype: int64

In [64]:
ser1=pd.Series([1,2,3,4],["CA","CB","OR","CO"])
ser2=pd.Series([1,2,5,4],["CA","NV","AZ","OR"])
ser3=ser1+ser2
ser3# where ever it is going to match with indexes then it is going to perform addition operation

AZ    NaN
CA    2.0
CB    NaN
CO    NaN
NV    NaN
OR    7.0
dtype: float64

In [65]:
print(ser1*ser2)

AZ     NaN
CA     1.0
CB     NaN
CO     NaN
NV     NaN
OR    12.0
dtype: float64

In [66]:
from numpy.random import randn as rn # it will try to generate random numbers on a normal distribution curve
matrix_data=rn(5,4)# Here iam try generate a data of size 5x4 i.e 5 rows 4 columns
matrix_data

array([[ 0.7574157 , -0.61814873,  0.86267723,  0.93547423],
       [ 1.30765057, -0.81499565,  0.39787239, -0.28979356],
       [-1.9268679 , -0.58614064,  2.52950226,  0.06188251],
       [-0.97477564, -1.66322644,  1.46153281,  1.0525437 ],
       [-0.04978288, -0.55000002, -0.42287694, -1.57158994]])

In [67]:
row_label=['A','B','C','D','E']
Column_Headings=['W','X','Y','Z']
df=pd.DataFrame(matrix_data,row_label,Column_Headings)
df

          W         X         Y         Z
A  0.757416 -0.618149  0.862677  0.935474
B  1.307651 -0.814996  0.397872 -0.289794
C -1.926868 -0.586141  2.529502  0.061883
D -0.974776 -1.663226  1.461533  1.052544
E -0.049783 -0.550000 -0.422877 -1.571590

In [68]:
#if i want extract Y column
df['Y']

A    0.862677
B    0.397872
C    2.529502
D    1.461533
E   -0.422877
Name: Y, dtype: float64

In [69]:
#if  i want to perfrom rowwise operation we have to iloc function i.e Here we will see the row data (i is nothing but integer loction)
df.iloc[2]

W   -1.926868
X   -0.586141
Y    2.529502
Z    0.061883
Name: C, dtype: float64

In [70]:
#loc always try to expects the original values (Rowname)
df.loc['C']

W   -1.926868
X   -0.586141
Y    2.529502
Z    0.061883
Name: C, dtype: float64

In [71]:
df

          W         X         Y         Z
A  0.757416 -0.618149  0.862677  0.935474
B  1.307651 -0.814996  0.397872 -0.289794
C -1.926868 -0.586141  2.529502  0.061883
D -0.974776 -1.663226  1.461533  1.052544
E -0.049783 -0.550000 -0.422877 -1.571590

In [72]:
df['New']=df['X']+df['Y']
df['New(Sum of X and Z)']=df['X']+df['Y']
df

          W         X         Y         Z       New  New(Sum of X and Z)
A  0.757416 -0.618149  0.862677  0.935474  0.244528             0.244528
B  1.307651 -0.814996  0.397872 -0.289794 -0.417123            -0.417123
C -1.926868 -0.586141  2.529502  0.061883  1.943362             1.943362
D -0.974776 -1.663226  1.461533  1.052544 -0.201694            -0.201694
E -0.049783 -0.550000 -0.422877 -1.571590 -0.972877            -0.972877

In [73]:
#Suppose if i wanted to delete the some of the data
df.drop("A")

          W         X         Y         Z       New  New(Sum of X and Z)
B  1.307651 -0.814996  0.397872 -0.289794 -0.417123            -0.417123
C -1.926868 -0.586141  2.529502  0.061883  1.943362             1.943362
D -0.974776 -1.663226  1.461533  1.052544 -0.201694            -0.201694
E -0.049783 -0.550000 -0.422877 -1.571590 -0.972877            -0.972877

In [74]:
#what if i want to delete X i.e column
#axis=0 means a row
#axis=1 means column
df.drop("X",axis=1)#but it doesn't make any changes to actual data frame , to mkae thischanges permently there is parameter called as inplace

          W         Y         Z       New  New(Sum of X and Z)
A  0.757416  0.862677  0.935474  0.244528             0.244528
B  1.307651  0.397872 -0.289794 -0.417123            -0.417123
C -1.926868  2.529502  0.061883  1.943362             1.943362
D -0.974776  1.461533  1.052544 -0.201694            -0.201694
E -0.049783 -0.422877 -1.571590 -0.972877            -0.972877

In [75]:
df

          W         X         Y         Z       New  New(Sum of X and Z)
A  0.757416 -0.618149  0.862677  0.935474  0.244528             0.244528
B  1.307651 -0.814996  0.397872 -0.289794 -0.417123            -0.417123
C -1.926868 -0.586141  2.529502  0.061883  1.943362             1.943362
D -0.974776 -1.663226  1.461533  1.052544 -0.201694            -0.201694
E -0.049783 -0.550000 -0.422877 -1.571590 -0.972877            -0.972877

In [76]:
df.drop("X",axis=1,inplace=True)
df

          W         Y         Z       New  New(Sum of X and Z)
A  0.757416  0.862677  0.935474  0.244528             0.244528
B  1.307651  0.397872 -0.289794 -0.417123            -0.417123
C -1.926868  2.529502  0.061883  1.943362             1.943362
D -0.974776  1.461533  1.052544 -0.201694            -0.201694
E -0.049783 -0.422877 -1.571590 -0.972877            -0.972877

In [77]:
df

          W         Y         Z       New  New(Sum of X and Z)
A  0.757416  0.862677  0.935474  0.244528             0.244528
B  1.307651  0.397872 -0.289794 -0.417123            -0.417123
C -1.926868  2.529502  0.061883  1.943362             1.943362
D -0.974776  1.461533  1.052544 -0.201694            -0.201694
E -0.049783 -0.422877 -1.571590 -0.972877            -0.972877

In [78]:
print(df.iloc[3])

W                     -0.974776
Y                      1.461533
Z                      1.052544
New                   -0.201694
New(Sum of X and Z)   -0.201694
Name: D, dtype: float64

In [79]:
print("Multiple Rows\n")
print(df.loc[['B','C']])

Multiple Rows

          W         Y         Z       New  New(Sum of X and Z)
B  1.307651  0.397872 -0.289794 -0.417123            -0.417123
C -1.926868  2.529502  0.061883  1.943362             1.943362

In [80]:
print("Multiple Rows\n")
print(df.iloc[[1,2]])

Multiple Rows

          W         Y         Z       New  New(Sum of X and Z)
B  1.307651  0.397872 -0.289794 -0.417123            -0.417123
C -1.926868  2.529502  0.061883  1.943362             1.943362

# Subsetting DataFrame

In [81]:
from numpy.random import randn as rn
matrix_data=rn(5,4)
row_labels=['A','B','C','D','E']
Column_heads=['W','X','Y','Z']
df=pd.DataFrame(data=matrix_data,index=row_labels,columns=Column_heads)
df

          W         X         Y         Z
A -0.195400  0.330104  0.244055  0.746112
B  0.197783 -2.395550  1.501272 -1.139004
C  1.006962 -1.238044 -1.606825 -1.602450
D -1.844846 -0.881825 -0.019390  0.248387
E -0.557727 -2.212983 -1.612942 -0.420657

In [82]:
df.iloc[1,]

W    0.197783
X   -2.395550
Y    1.501272
Z   -1.139004
Name: B, dtype: float64

In [83]:
df.iloc[1:,]

          W         X         Y         Z
B  0.197783 -2.395550  1.501272 -1.139004
C  1.006962 -1.238044 -1.606825 -1.602450
D -1.844846 -0.881825 -0.019390  0.248387
E -0.557727 -2.212983 -1.612942 -0.420657

In [84]:
#I wanted to get intersetion of data
print(df.loc[['B','C'],['X','Y']])

          X         Y
B -2.395550  1.501272
C -1.238044 -1.606825

In [85]:
#Here iam trying to extract data from original indexes
df.iloc[[1,2,3],[0,1]]

          W         X
B  0.197783 -2.395550
C  1.006962 -1.238044
D -1.844846 -0.881825

In [86]:
df

          W         X         Y         Z
A -0.195400  0.330104  0.244055  0.746112
B  0.197783 -2.395550  1.501272 -1.139004
C  1.006962 -1.238044 -1.606825 -1.602450
D -1.844846 -0.881825 -0.019390  0.248387
E -0.557727 -2.212983 -1.612942 -0.420657

In [87]:
df.iloc[[1,3]]#Here i want to extract 1st and 3rd row

          W         X         Y         Z
B  0.197783 -2.395550  1.501272 -1.139004
D -1.844846 -0.881825 -0.019390  0.248387

In [88]:
df.loc[["A","D"]]

          W         X         Y         Z
A -0.195400  0.330104  0.244055  0.746112
D -1.844846 -0.881825 -0.019390  0.248387

In [89]:
df.loc[['A'],["Y"]]

          Y
A  0.244055

In [90]:
df.loc[['A'],["Y","W"]]

          Y       W
A  0.244055 -0.1954

In [91]:
df.loc[['A','D'],["Y",'W']]

          Y         W
A  0.244055 -0.195400
D -0.019390 -1.844846

In [92]:
 #extracting data from column
#Here iam trying to extract all the rows data from the 3rd column
df.iloc[:,[3]]

          Z
A  0.746112
B -1.139004
C -1.602450
D  0.248387
E -0.420657

In [93]:
df.iloc[:,[2,3]]

          Y         Z
A  0.244055  0.746112
B  1.501272 -1.139004
C -1.606825 -1.602450
D -0.019390  0.248387
E -1.612942 -0.420657

In [94]:
df.iloc[:,[1,3]]

          X         Z
A  0.330104  0.746112
B -2.395550 -1.139004
C -1.238044 -1.602450
D -0.881825  0.248387
E -2.212983 -0.420657

In [95]:
#Hereiam doing the Boolean operation
#df>0 perform boolean operation
print(df>0)

       W      X      Y      Z
A  False   True   True   True
B   True  False   True  False
C   True  False  False  False
D  False  False  False   True
E  False  False  False  False

In [96]:
df.loc[['A','B','C']]>0

       W      X      Y      Z
A  False   True   True   True
B   True  False   True  False
C   True  False  False  False

In [97]:
#Here where ever it is false i will print nan value where ever it true i.e >0 it will print the value
print(df[df>0])

          W         X         Y         Z
A       NaN  0.330104  0.244055  0.746112
B  0.197783       NaN  1.501272       NaN
C  1.006962       NaN       NaN       NaN
D       NaN       NaN       NaN  0.248387
E       NaN       NaN       NaN       NaN

In [98]:
#if i want change the specific value in the row and column
df

          W         X         Y         Z
A -0.195400  0.330104  0.244055  0.746112
B  0.197783 -2.395550  1.501272 -1.139004
C  1.006962 -1.238044 -1.606825 -1.602450
D -1.844846 -0.881825 -0.019390  0.248387
E -0.557727 -2.212983 -1.612942 -0.420657

In [99]:
df.loc[["A"],["Z"]]=8328
df

          W         X         Y            Z
A -0.195400  0.330104  0.244055  8328.000000
B  0.197783 -2.395550  1.501272    -1.139004
C  1.006962 -1.238044 -1.606825    -1.602450
D -1.844846 -0.881825 -0.019390     0.248387
E -0.557727 -2.212983 -1.612942    -0.420657

In [100]:
import pandas as pd
import numpy as np
matrix_data=np.matrix('22,66,14;56,89,56;89,56,23;56,45,89;25,89,56')
row_lables=['A','B','C','D','E']
Column_headings=['Age','Height','Weight']
matrix_data

matrix([[22, 66, 14],
        [56, 89, 56],
        [89, 56, 23],
        [56, 45, 89],
        [25, 89, 56]])

In [101]:
df=pd.DataFrame(data=matrix_data,index=row_lables,columns=Column_headings)
df

   Age  Height  Weight
A   22      66      14
B   56      89      56
C   89      56      23
D   56      45      89
E   25      89      56

In [102]:
#if didnt mention any rows and columns it will take default
pd.DataFrame(data=matrix_data)

    0   1   2
0  22  66  14
1  56  89  56
2  89  56  23
3  56  45  89
4  25  89  56

In [103]:
df['Height']>65

A     True
B     True
C    False
D    False
E     True
Name: Height, dtype: bool

In [104]:
#Where ever the height is 65 it going to print that paricular row and index
df[df['Height']>65]

   Age  Height  Weight
A   22      66      14
B   56      89      56
E   25      89      56

In [111]:
booldf1=df['Height']>65
booldf2=df['Weight']>50

In [112]:
print(df[(booldf1) & (booldf2)])

   Age  Height  Weight
B   56      89      56
E   25      89      56

In [113]:
print(df[booldf1][['Age','Weight']])

   Age  Weight
A   22      14
B   56      56
E   25      56

In [115]:
df

   Age  Height  Weight
A   22      66      14
B   56      89      56
C   89      56      23
D   56      45      89
E   25      89      56

In [114]:
print(df.reset_index())#if want to reset ur indexes with the original indexes

  index  Age  Height  Weight
0     A   22      66      14
1     B   56      89      56
2     C   89      56      23
3     D   56      45      89
4     E   25      89      56

In [116]:
#if drop = flase it means make the changes  but dont drop drop the old one
print(df.reset_index(drop=True))

   Age  Height  Weight
0   22      66      14
1   56      89      56
2   89      56      23
3   56      45      89
4   25      89      56

In [117]:
"Student Teacher Engineer Doctor Nurse".split()

['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']

In [118]:
#Here iam trying to create a new column as profession
df['profession']="Student Teacher Engineer Doctor Nurse".split()
df

   Age  Height  Weight profession
A   22      66      14    Student
B   56      89      56    Teacher
C   89      56      23   Engineer
D   56      45      89     Doctor
E   25      89      56      Nurse

In [122]:
#At any point of a time if i wanted to make any column as index we can use set_index
print(df.set_index('profession'))

            Age  Height  Weight
profession
Student      22      66      14
Teacher      56      89      56
Engineer     89      56      23
Doctor       56      45      89
Nurse        25      89      56

# multi-indexing

In [123]:
out_side=['G1','G1','G1','G2','G2','G2']
in_side=[1,2,3,1,2,3]
heir_index=list(zip(out_side,in_side))
heir_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [126]:
hir_index=pd.MultiIndex.from_tuples(heir_index)
hir_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [127]:
type(hir_index)

pandas.core.indexes.multi.MultiIndex

In [128]:
df1=pd.DataFrame(data=np.round(rn(6,3)),index=hir_index,columns=['A','B','C'])
df1

        A    B    C
G1 1  1.0 -1.0 -1.0
   2  1.0  0.0 -0.0
   3  2.0  1.0  1.0
G2 1  1.0 -1.0 -1.0
   2 -1.0  0.0 -0.0
   3  1.0  1.0 -2.0

In [129]:
df1.loc['G1']

     A    B    C
1  1.0 -1.0 -1.0
2  1.0  0.0 -0.0
3  2.0  1.0  1.0

In [130]:
df1.loc['G1'].loc[2]#loc work with row name

A    1.0
B    0.0
C   -0.0
Name: 2, dtype: float64

In [133]:
df1.loc['G1'].iloc[1] #i loc will work with indexes if compare both in loc we gave row name where iloc we gave index

A    1.0
B    0.0
C   -0.0
Name: 2, dtype: float64

In [134]:
#xs: it try to always give u the cross section of the rows and columns
print(df1.xs('G1'))

     A    B    C
1  1.0 -1.0 -1.0
2  1.0  0.0 -0.0
3  2.0  1.0  1.0

In [135]:
df

   Age  Height  Weight profession
A   22      66      14    Student
B   56      89      56    Teacher
C   89      56      23   Engineer
D   56      45      89     Doctor
E   25      89      56      Nurse

In [137]:
df.iloc[0,2]# i loc always excepts the numerical data i.e indexes it will never work with categorical data

14